{   
  "br": {
    "homepage": {
      "title1": "Olá, eu sou João Pedro",
      "title2": "Desenvolvedor Front-End",
      "subtitle": "Trabalho com React, TypeScript, JavaScript, HTML, CSS e Python, desenvolvendo sites responsivos, performáticos e com foco em boas práticas de UI/UX. Tenho experiência com automação de processos e estou sempre em busca de entregar soluções funcionais e centradas no usuário.",
      "downloadButton": "Baixar Currículo"
    },
    "about": {
      "title": "Sobre Mim",
      "description1": "Atualmente no 5º período de Ciência da Computação na UFLA, atuo há mais de um ano com desenvolvimento web em projetos pessoais, acadêmicos e profissionais. Tenho domínio sólido de HTML, CSS e JavaScript, além de experiência prática com React (Hooks, Router), testes com Jest e Cypress, e criação de APIs com Node.js.",
      "description2": "Durante minha jornada, participei de projetos reais tanto no Unilavras, como estagiário, quanto no grupo Gloriumm, o que me proporcionou vivência em equipes multidisciplinares e foco em entregas com qualidade. Atuo hoje na equipe de marketing do Unilavras, desenvolvendo soluções front-end alinhadas à identidade visual da instituição.",
      "description3": "Concluí o curso de Desenvolvedor Front-End da DNC e busco constantemente expandir minhas habilidades — inclusive aprendi Tailwind CSS por conta prória. Também tenho familiaridade com ferramentas de versionamento como Git e organização de branches por ambiente de desenvolvimento.",
      "description4": "Gosto de criar interfaces funcionais, acessíveis e com atenção ao detalhe. Valorizo o trabalho em equipe, a organização por etapas e o aprendizado contínuo. Neste portfólio, compartilho projetos que refletem minha evolução técnica e meu compromisso com o desenvolvimento web moderno.s"
    },
    "contact": {
      "title": "Contato"
    },
    "projects": {
      "title": "Projetos",
      "subtitle": "Nesta página estão listados os principais projetos que contribuíram para o meu aprendizado. Incluem trabalhos pessoais, acadêmicos e profissionais."
    },
    "curriculum": {
      "title": "Currículo",
      "location": "24 anos, Lavras/MG",
      "summaryTitle": "Resumo Profissional",
      "summaryDescription": "Estudante de Ciência da Computação na UFLA com experiência prática em desenvolvimento Front-End, atuando no Unilavras na criação e manutenção de páginas web responsivas e acessíveis. Familiaridade com tecnologias como HTML, CSS, JavaScript, React e TypeScript, com foco em UX/UI e boas práticas de código.",
      "hardSkills": "Habilidades Técnicas",
      "softSkills": "Habilidades Comportamentais",
      "experienceTitle":"Experiencias Profisionais",
      "experience0": {
        "position": "Estagiário - Desenvolvedor Front-End",
        "enterprise": "Unilavras",
        "period": "Dez/2024 – Atual",
        "description": "Desenvolvimento de páginas institucionais e não institucionais no WordPress com HTML, CSS e JavaScript. Foco em responsividade, SEO e colaboração com a equipe de marketing."
      },
      "experience1": {
        "position": "Treinamento - Desenvolvedor Front-End",
        "enterprise":"Grupo Glorium",
        "period": "Jun/2023 – Dez/2023",
        "description": "Desenvolvimento de sites responsivos com HTML, CSS (SASS), Bootstrap, JavaScript e PHP. Foco em responsividade e boas práticas de UX/UI."
      },
      "educationTitle": "Formação Acadêmica",
      "education": {
        "title": "Bacharelado em Ciência da Computação – UFLA",
        "date": "(2022 – 2026)"
      },
      "certifications": {
        "title": "Cursos e Certificações",
        "course0": {
          "title": "Desenvolvedor Front-End - DNC",
          "hours": "(80h)",
          "description": "HTML, CSS, JavaScript, Vite, React, TypeScript, testes unitários com Jest, testes end-to-end, hooks e Axios."
        },
        "course1": {
          "title": "Fundamentos de C# - Microsoft",
          "hours": "(20h)",
          "description": "Conceitos e fundamentos da linguagem C#."
        },
        "course2": {
          "title": "Segurança em TI - Fundação Bradesco",
          "hours": "(12h)",
          "description": "LGPD e fundamentos da segurança da informação."
        }
      },
      "languages": {
        "title": "Idiomas",
        "portuguese": {
          "title": "Português",
          "proficiency": "Nativo"
        },
        "english": {
          "title": "Inglês",
          "proficiency": "Intermediário"
        },
        "spanish": {
          "title": "Espanhol",
          "proficiency": "Intermediário"
        }
      }
    },
    "theme": "Tema"
  },
  "en": {
  "homepage": {
    "title1": "Hi, I'm João Pedro",
    "title2": "Front-End Developer",
    "subtitle": "I work with React, TypeScript, JavaScript, HTML, CSS, and Python, developing responsive and high-performance websites with a focus on UI/UX best practices. I have experience with process automation and I'm always looking to deliver functional and user-centered solutions.",
    "downloadButton": "Download Resume"
  },
  "about": {
    "title": "About Me",
    "description1": "Currently in the 5th semester of Computer Science at UFLA, I have over a year of experience in web development through personal, academic, and professional projects. I have solid knowledge of HTML, CSS, and JavaScript, as well as hands-on experience with React (Hooks, Router), testing with Jest and Cypress, and API creation using Node.js.",
    "description2": "Throughout my journey, I’ve taken part in real-world projects both at Unilavras, as an intern, and at the Gloriumm group, which gave me valuable experience working in multidisciplinary teams and delivering quality-focused results. I currently work in the marketing team at Unilavras, developing front-end solutions aligned with the institution's visual identity.",
    "description3": "I completed the Front-End Developer course at DNC and am constantly seeking to expand my skills — I even learned Tailwind CSS on my own. I’m also familiar with version control tools like Git and with organizing branches for different development environments.",
    "description4": "I enjoy creating functional, accessible, and detail-oriented interfaces. I value teamwork, step-by-step organization, and continuous learning. In this portfolio, I share projects that reflect both my technical growth and my commitment to modern web development."
  },
  "contact": {
    "title": "Contact"
  },
  "projects": {
    "title": "Projects",
    "subtitle": "This page lists the main projects that contributed to my learning. It includes personal, academic, and professional work."
  },
  "curriculum": {
    "title": "Resume",
    "location": "24 years old, Lavras/MG, Brazil",
    "summaryTitle": "Professional Summary",
    "summaryDescription": "Computer Science student at UFLA with hands-on experience in Front-End development, working at Unilavras creating and maintaining responsive and accessible web pages. Familiar with technologies such as HTML, CSS, JavaScript, React, and TypeScript, with a focus on UX/UI and clean code practices.",
    "hardSkills": "Technical Skills",
    "softSkills": "Soft Skills",
    "experienceTitle": "Professional Experiences",
    "experience0": {
      "position": "Web Development Intern",
      "enterprise":"Unilavras",
      "period": "Dec/2024 – Present",
      "description": "Development of institutional and non-institutional pages in WordPress using HTML, CSS, and JavaScript. Focused on responsiveness, SEO, and collaboration with the marketing team."
    },
    "experience1": {
      "position": "Web Developer Training ",
      "enterprise":"Grupo Glorium",
      "period": "Jun/2023 – Dec/2023",
      "description": "Development of responsive websites using HTML, CSS (SASS), Bootstrap, JavaScript, and PHP. Focus on accessibility and UX/UI best practices."
    },
    "educationTitle": "Education",
    "education": {
      "title": "Bachelor's in Computer Science – UFLA",
      "date": "(2022 – 2026)"
    },
    "certifications": {
      "title": "Courses and Certifications",
      "course0": {
        "title": "Front-End Developer - DNC",
        "hours": "(80h)",
        "description": "HTML, CSS, JavaScript, Vite, React, TypeScript, unit testing with Jest, end-to-end testing, hooks, and Axios."
      },
      "course1": {
        "title": "C# Fundamentals - Microsoft",
        "hours": "(20h)",
        "description": "Concepts and fundamentals of the C# programming language."
      },
      "course2": {
        "title": "IT Security - Fundação Bradesco",
        "hours": "(12h)",
        "description": "LGPD and information security fundamentals."
      }
    },
    "languages": {
      "title": "Languages",
      "portuguese": {
        "title": "Portuguese",
        "proficiency": "Native"
      },
      "english": {
        "title": "English",
        "proficiency": "Intermediate"
      },
      "spanish": {
        "title": "Spanish",
        "proficiency": "Intermediate"
      }
    }
  },
  "theme": "Theme"
},

  "es": {
  "homepage": {
    "title1": "Hola, soy João Pedro",
    "title2": "Desarrollador Front-End",
    "subtitle": "Trabajo con React, TypeScript, JavaScript, HTML, CSS y Python, desarrollando sitios web responsivos, de alto rendimiento y enfocados en buenas prácticas de UI/UX. Tengo experiencia en automatización de procesos y siempre busco entregar soluciones funcionales y centradas en el usuario.",
    "downloadButton": "Descargar Currículum"
  },
  "about": {
    "title": "Sobre Mí",
    "description1": "Actualmente en el quinto semestre de Ciencias de la Computación en la UFLA, tengo más de un año de experiencia en desarrollo web a través de proyectos personales, académicos y profesionales. Tengo un sólido dominio de HTML, CSS y JavaScript, además de experiencia práctica con React (Hooks, Router), pruebas con Jest y Cypress, y creación de APIs con Node.js.",
    "description2": "A lo largo de mi trayectoria, participé en proyectos reales tanto en Unilavras, como pasante, como en el grupo Gloriumm, lo que me brindó experiencia en equipos multidisciplinarios y un enfoque en entregas de calidad. Actualmente formo parte del equipo de marketing de Unilavras, desarrollando soluciones front-end alineadas con la identidad visual de la institución.",
    "description3": "Completé el curso de Desarrollador Front-End de DNC y busco constantemente expandir mis habilidades — incluso aprendí Tailwind CSS por mi cuenta. También tengo familiaridad con herramientas de control de versiones como Git y con la organización de ramas según el entorno de desarrollo.",
    "description4": "Me gusta crear interfaces funcionales, accesibles y con atención al detalle. Valoro el trabajo en equipo, la organización por etapas y el aprendizaje continuo. En este portafolio, comparto proyectos que reflejan mi evolución técnica y mi compromiso con el desarrollo web moderno."
  },
  "contact": {
    "title": "Contacto"
  },
  "projects": {
    "title": "Proyectos",
    "subtitle": "En esta página se listan los principales proyectos que contribuyeron a mi aprendizaje. Incluye trabajos personales, académicos y profesionales."
  },
  "curriculum": {
    "title": "Currículum",
    "location": "24 años, Lavras/MG, Brasil",
    "summaryTitle": "Resumen Profesional",
    "summaryDescription": "Estudiante de Ciencias de la Computación en UFLA con experiencia práctica en desarrollo Front-End, actuando en Unilavras en la creación y mantenimiento de páginas web responsivas y accesibles. Familiaridad con tecnologías como HTML, CSS, JavaScript, React y TypeScript, con enfoque en UX/UI y buenas prácticas de código.",
    "hardSkills": "Habilidades Técnicas",
    "softSkills": "Habilidades Interpersonales",
    "experienceTitle": "Experiencias Profesionales",
    "experience0": {
      "position": "Practicante en Desarrollo Web",
      "enterprise":"Unilavras",
      "period": "Dic/2024 – Actualidad",
      "description": "Desarrollo de páginas institucionales y no institucionales en WordPress utilizando HTML, CSS y JavaScript. Enfocado en la responsividad, el SEO y la colaboración con el equipo de marketing."
    },
    "experience1": {
      "position": "Capacitación en Desarrollo Web",
      "enterprise":"Grupo Glorium",
      "period": "Jun/2023 – Dic/2023",
      "description": "Desarrollo de sitios responsivos con HTML, CSS (SASS), Bootstrap, JavaScript y PHP. Enfoque en accesibilidad y buenas prácticas de UX/UI."
    },
    "educationTitle": "Formación Académica",
    "education": {
      "title": "Licenciatura en Ciencias de la Computación – UFLA",
      "date": "(2022 – 2026)"
    },
    "certifications": {
      "title": "Cursos y Certificaciones",
      "course0": {
        "title": "Desarrollador Front-End - DNC",
        "hours": "(80h)",
        "description": "HTML, CSS, JavaScript, Vite, React, TypeScript, pruebas unitarias con Jest, pruebas end-to-end, hooks y Axios."
      },
      "course1": {
        "title": "Fundamentos de C# - Microsoft",
        "hours": "(20h)",
        "description": "Conceptos y fundamentos del lenguaje C#."
      },
      "course2": {
        "title": "Seguridad en TI - Fundación Bradesco",
        "hours": "(12h)",
        "description": "LGPD y fundamentos de la seguridad de la información."
      }
    },
    "languages": {
      "title": "Idiomas",
      "portuguese": {
        "title": "Portugués",
        "proficiency": "Nativo"
      },
      "english": {
        "title": "Inglés",
        "proficiency": "Intermedio"
      },
      "spanish": {
        "title": "Español",
        "proficiency": "Intermedio"
      }
    }
  },
  "theme": "Tema"
}

}